package org.telegram.ui.Components;

import java.util.HashMap;
import java.util.Map;

final class YasuVoiceNumberDict_997 {
    private static final Map<String, Integer> IQ = new HashMap<>();
    private static final Map<String, Integer> FU = new HashMap<>();
    static {
        FU.put("ماية وعشرين وخمسه", 125);
        FU.put("ماية وعشرين وسبعة", 127);
        FU.put("ماية وعشرين وسبعه", 127);
        FU.put("ماية وعشرين وستة", 126);
        FU.put("ماية وعشرين وسته", 126);
        FU.put("ماية وعشرين وواحد", 121);
        FU.put("ماية وعشرين وواحدا", 121);
        FU.put("ماية وواحد", 101);
        FU.put("ماية وواحد وأربعون", 141);
        FU.put("ماية وواحد وأربعين", 141);
        FU.put("ماية وواحد واربعون", 141);
        FU.put("ماية وواحد واربعين", 141);
        FU.put("ماية وواحد وتسعون", 191);
        FU.put("ماية وواحد وتسعين", 191);
        FU.put("ماية وواحد وثلاثون", 131);
        FU.put("ماية وواحد وثلاثين", 131);
        FU.put("ماية وواحد وثمانون", 181);
        FU.put("ماية وواحد وثمانين", 181);
        FU.put("ماية وواحد وخمسون", 151);
        FU.put("ماية وواحد وخمسين", 151);
        FU.put("ماية وواحد وسبعون", 171);
        FU.put("ماية وواحد وسبعين", 171);
        FU.put("ماية وواحد وستون", 161);
        FU.put("ماية وواحد وستين", 161);
        FU.put("ماية وواحد وعشرون", 121);
        FU.put("ماية وواحد وعشرين", 121);
        FU.put("ماية وواحدا", 101);
        FU.put("ماية وواحدا وأربعون", 141);
        FU.put("ماية وواحدا وأربعين", 141);
        FU.put("ماية وواحدا واربعون", 141);
        FU.put("ماية وواحدا واربعين", 141);
        FU.put("ماية وواحدا وتسعون", 191);
        FU.put("ماية وواحدا وتسعين", 191);
        FU.put("ماية وواحدا وثلاثون", 131);
        FU.put("ماية وواحدا وثلاثين", 131);
        FU.put("ماية وواحدا وثمانون", 181);
        FU.put("ماية وواحدا وثمانين", 181);
        FU.put("ماية وواحدا وخمسون", 151);
        FU.put("ماية وواحدا وخمسين", 151);
        FU.put("ماية وواحدا وسبعون", 171);
        FU.put("ماية وواحدا وسبعين", 171);
        FU.put("ماية وواحدا وستون", 161);
        FU.put("ماية وواحدا وستين", 161);
        FU.put("ماية وواحدا وعشرون", 121);
        FU.put("ماية وواحدا وعشرين", 121);
    }
    static Integer iq(String s) { return IQ.get(s); }
    static Integer fu(String s) { return FU.get(s); }
}