package org.telegram.ui.Components;

import java.util.HashMap;
import java.util.Map;

final class YasuVoiceNumberDict_1148 {
    private static final Map<String, Integer> IQ = new HashMap<>();
    private static final Map<String, Integer> FU = new HashMap<>();
    static {
        IQ.put("ميتينه وكلاثين وسته", 236);
        IQ.put("ميتينه وكلاثين وكلاث", 233);
        IQ.put("ميتينه وكلاثين وكلاثه", 233);
        IQ.put("ميتينه وكلاثين وواحد", 231);
        IQ.put("ميتينه وكلاثين وواحده", 231);
        IQ.put("ميتينه وكلاثين ووحده", 231);
        IQ.put("ميتينه وكلطعش", 213);
        IQ.put("ميتينه وواحد", 201);
        IQ.put("ميتينه وواحد وأربعين", 241);
        IQ.put("ميتينه وواحد واربعين", 241);
        IQ.put("ميتينه وواحد وتسعين", 291);
        IQ.put("ميتينه وواحد وثلاثين", 231);
        IQ.put("ميتينه وواحد وثمانين", 281);
        IQ.put("ميتينه وواحد وثمنين", 281);
        IQ.put("ميتينه وواحد وخمسين", 251);
        IQ.put("ميتينه وواحد وسبعين", 271);
        IQ.put("ميتينه وواحد وستين", 261);
        IQ.put("ميتينه وواحد وعشرين", 221);
        IQ.put("ميتينه وواحد وكلاثين", 231);
        IQ.put("ميتينه وواحده", 201);
        IQ.put("ميتينه وواحده وأربعين", 241);
        IQ.put("ميتينه وواحده واربعين", 241);
        IQ.put("ميتينه وواحده وتسعين", 291);
        IQ.put("ميتينه وواحده وثلاثين", 231);
        IQ.put("ميتينه وواحده وثمانين", 281);
        IQ.put("ميتينه وواحده وثمنين", 281);
        IQ.put("ميتينه وواحده وخمسين", 251);
        IQ.put("ميتينه وواحده وسبعين", 271);
        IQ.put("ميتينه وواحده وستين", 261);
        IQ.put("ميتينه وواحده وعشرين", 221);
        IQ.put("ميتينه وواحده وكلاثين", 231);
        IQ.put("ميتينه ووحده", 201);
        IQ.put("ميتينه ووحده وأربعين", 241);
        IQ.put("ميتينه ووحده واربعين", 241);
        IQ.put("ميتينه ووحده وتسعين", 291);
        IQ.put("ميتينه ووحده وثلاثين", 231);
        IQ.put("ميتينه ووحده وثمانين", 281);
        IQ.put("ميتينه ووحده وثمنين", 281);
        IQ.put("ميتينه ووحده وخمسين", 251);
        IQ.put("ميتينه ووحده وسبعين", 271);
        IQ.put("ميتينه ووحده وستين", 261);
        IQ.put("ميتينه ووحده وعشرين", 221);
        IQ.put("ميتينه ووحده وكلاثين", 231);
    }
    static Integer iq(String s) { return IQ.get(s); }
    static Integer fu(String s) { return FU.get(s); }
}