package org.telegram.ui.Components;

import java.util.HashMap;
import java.util.Map;

final class YasuVoiceNumberDict_591 {
    private static final Map<String, Integer> IQ = new HashMap<>();
    private static final Map<String, Integer> FU = new HashMap<>();
    static {
        IQ.put("ثمنميه وكلاثين وسته", 836);
        IQ.put("ثمنميه وكلاثين وكلاث", 833);
        IQ.put("ثمنميه وكلاثين وكلاثه", 833);
        IQ.put("ثمنميه وكلاثين وواحد", 831);
        IQ.put("ثمنميه وكلاثين وواحده", 831);
        IQ.put("ثمنميه وكلاثين ووحده", 831);
        IQ.put("ثمنميه وكلطعش", 813);
        IQ.put("ثمنميه وواحد", 801);
        IQ.put("ثمنميه وواحد وأربعين", 841);
        IQ.put("ثمنميه وواحد واربعين", 841);
        IQ.put("ثمنميه وواحد وتسعين", 891);
        IQ.put("ثمنميه وواحد وثلاثين", 831);
        IQ.put("ثمنميه وواحد وثمانين", 881);
        IQ.put("ثمنميه وواحد وثمنين", 881);
        IQ.put("ثمنميه وواحد وخمسين", 851);
        IQ.put("ثمنميه وواحد وسبعين", 871);
        IQ.put("ثمنميه وواحد وستين", 861);
        IQ.put("ثمنميه وواحد وعشرين", 821);
        IQ.put("ثمنميه وواحد وكلاثين", 831);
        IQ.put("ثمنميه وواحده", 801);
        IQ.put("ثمنميه وواحده وأربعين", 841);
        IQ.put("ثمنميه وواحده واربعين", 841);
        IQ.put("ثمنميه وواحده وتسعين", 891);
        IQ.put("ثمنميه وواحده وثلاثين", 831);
        IQ.put("ثمنميه وواحده وثمانين", 881);
        IQ.put("ثمنميه وواحده وثمنين", 881);
        IQ.put("ثمنميه وواحده وخمسين", 851);
        IQ.put("ثمنميه وواحده وسبعين", 871);
        IQ.put("ثمنميه وواحده وستين", 861);
        IQ.put("ثمنميه وواحده وعشرين", 821);
        IQ.put("ثمنميه وواحده وكلاثين", 831);
        IQ.put("ثمنميه ووحده", 801);
        IQ.put("ثمنميه ووحده وأربعين", 841);
        IQ.put("ثمنميه ووحده واربعين", 841);
        IQ.put("ثمنميه ووحده وتسعين", 891);
        IQ.put("ثمنميه ووحده وثلاثين", 831);
        IQ.put("ثمنميه ووحده وثمانين", 881);
        IQ.put("ثمنميه ووحده وثمنين", 881);
        IQ.put("ثمنميه ووحده وخمسين", 851);
        IQ.put("ثمنميه ووحده وسبعين", 871);
        IQ.put("ثمنميه ووحده وستين", 861);
        IQ.put("ثمنميه ووحده وعشرين", 821);
        IQ.put("ثمنميه ووحده وكلاثين", 831);
    }
    static Integer iq(String s) { return IQ.get(s); }
    static Integer fu(String s) { return FU.get(s); }
}