package org.telegram.ui.Components;

import java.util.HashMap;
import java.util.Map;

final class YasuVoiceNumberDict_578 {
    private static final Map<String, Integer> IQ = new HashMap<>();
    private static final Map<String, Integer> FU = new HashMap<>();
    static {
        IQ.put("ثمنمية وكلاثين وسته", 836);
        IQ.put("ثمنمية وكلاثين وكلاث", 833);
        IQ.put("ثمنمية وكلاثين وكلاثه", 833);
        IQ.put("ثمنمية وكلاثين وواحد", 831);
        IQ.put("ثمنمية وكلاثين وواحده", 831);
        IQ.put("ثمنمية وكلاثين ووحده", 831);
        IQ.put("ثمنمية وكلطعش", 813);
        IQ.put("ثمنمية وواحد", 801);
        IQ.put("ثمنمية وواحد وأربعين", 841);
        IQ.put("ثمنمية وواحد واربعين", 841);
        IQ.put("ثمنمية وواحد وتسعين", 891);
        IQ.put("ثمنمية وواحد وثلاثين", 831);
        IQ.put("ثمنمية وواحد وثمانين", 881);
        IQ.put("ثمنمية وواحد وثمنين", 881);
        IQ.put("ثمنمية وواحد وخمسين", 851);
        IQ.put("ثمنمية وواحد وسبعين", 871);
        IQ.put("ثمنمية وواحد وستين", 861);
        IQ.put("ثمنمية وواحد وعشرين", 821);
        IQ.put("ثمنمية وواحد وكلاثين", 831);
        IQ.put("ثمنمية وواحده", 801);
        IQ.put("ثمنمية وواحده وأربعين", 841);
        IQ.put("ثمنمية وواحده واربعين", 841);
        IQ.put("ثمنمية وواحده وتسعين", 891);
        IQ.put("ثمنمية وواحده وثلاثين", 831);
        IQ.put("ثمنمية وواحده وثمانين", 881);
        IQ.put("ثمنمية وواحده وثمنين", 881);
        IQ.put("ثمنمية وواحده وخمسين", 851);
        IQ.put("ثمنمية وواحده وسبعين", 871);
        IQ.put("ثمنمية وواحده وستين", 861);
        IQ.put("ثمنمية وواحده وعشرين", 821);
        IQ.put("ثمنمية وواحده وكلاثين", 831);
        IQ.put("ثمنمية ووحده", 801);
        IQ.put("ثمنمية ووحده وأربعين", 841);
        IQ.put("ثمنمية ووحده واربعين", 841);
        IQ.put("ثمنمية ووحده وتسعين", 891);
        IQ.put("ثمنمية ووحده وثلاثين", 831);
        IQ.put("ثمنمية ووحده وثمانين", 881);
        IQ.put("ثمنمية ووحده وثمنين", 881);
        IQ.put("ثمنمية ووحده وخمسين", 851);
        IQ.put("ثمنمية ووحده وسبعين", 871);
        IQ.put("ثمنمية ووحده وستين", 861);
        IQ.put("ثمنمية ووحده وعشرين", 821);
        IQ.put("ثمنمية ووحده وكلاثين", 831);
    }
    static Integer iq(String s) { return IQ.get(s); }
    static Integer fu(String s) { return FU.get(s); }
}