package org.telegram.ui.Components;

import java.util.HashMap;
import java.util.Map;

final class YasuVoiceNumberDict_966 {
    private static final Map<String, Integer> IQ = new HashMap<>();
    private static final Map<String, Integer> FU = new HashMap<>();
    static {
        IQ.put("كلاثمية وكلاثين وسته", 336);
        IQ.put("كلاثمية وكلاثين وكلاث", 333);
        IQ.put("كلاثمية وكلاثين وكلاثه", 333);
        IQ.put("كلاثمية وكلاثين وواحد", 331);
        IQ.put("كلاثمية وكلاثين وواحده", 331);
        IQ.put("كلاثمية وكلاثين ووحده", 331);
        IQ.put("كلاثمية وكلطعش", 313);
        IQ.put("كلاثمية وواحد", 301);
        IQ.put("كلاثمية وواحد وأربعين", 341);
        IQ.put("كلاثمية وواحد واربعين", 341);
        IQ.put("كلاثمية وواحد وتسعين", 391);
        IQ.put("كلاثمية وواحد وثلاثين", 331);
        IQ.put("كلاثمية وواحد وثمانين", 381);
        IQ.put("كلاثمية وواحد وثمنين", 381);
        IQ.put("كلاثمية وواحد وخمسين", 351);
        IQ.put("كلاثمية وواحد وسبعين", 371);
        IQ.put("كلاثمية وواحد وستين", 361);
        IQ.put("كلاثمية وواحد وعشرين", 321);
        IQ.put("كلاثمية وواحد وكلاثين", 331);
        IQ.put("كلاثمية وواحده", 301);
        IQ.put("كلاثمية وواحده وأربعين", 341);
        IQ.put("كلاثمية وواحده واربعين", 341);
        IQ.put("كلاثمية وواحده وتسعين", 391);
        IQ.put("كلاثمية وواحده وثلاثين", 331);
        IQ.put("كلاثمية وواحده وثمانين", 381);
        IQ.put("كلاثمية وواحده وثمنين", 381);
        IQ.put("كلاثمية وواحده وخمسين", 351);
        IQ.put("كلاثمية وواحده وسبعين", 371);
        IQ.put("كلاثمية وواحده وستين", 361);
        IQ.put("كلاثمية وواحده وعشرين", 321);
        IQ.put("كلاثمية وواحده وكلاثين", 331);
        IQ.put("كلاثمية ووحده", 301);
        IQ.put("كلاثمية ووحده وأربعين", 341);
        IQ.put("كلاثمية ووحده واربعين", 341);
        IQ.put("كلاثمية ووحده وتسعين", 391);
        IQ.put("كلاثمية ووحده وثلاثين", 331);
        IQ.put("كلاثمية ووحده وثمانين", 381);
        IQ.put("كلاثمية ووحده وثمنين", 381);
        IQ.put("كلاثمية ووحده وخمسين", 351);
        IQ.put("كلاثمية ووحده وسبعين", 371);
        IQ.put("كلاثمية ووحده وستين", 361);
        IQ.put("كلاثمية ووحده وعشرين", 321);
        IQ.put("كلاثمية ووحده وكلاثين", 331);
    }
    static Integer iq(String s) { return IQ.get(s); }
    static Integer fu(String s) { return FU.get(s); }
}