package org.telegram.ui.Components;

import java.util.HashMap;
import java.util.Map;

final class YasuVoiceNumberDict_326 {
    private static final Map<String, Integer> IQ = new HashMap<>();
    private static final Map<String, Integer> FU = new HashMap<>();
    static {
        IQ.put("تسعميه وكلاثين وسته", 936);
        IQ.put("تسعميه وكلاثين وكلاث", 933);
        IQ.put("تسعميه وكلاثين وكلاثه", 933);
        IQ.put("تسعميه وكلاثين وواحد", 931);
        IQ.put("تسعميه وكلاثين وواحده", 931);
        IQ.put("تسعميه وكلاثين ووحده", 931);
        IQ.put("تسعميه وكلطعش", 913);
        IQ.put("تسعميه وواحد", 901);
        IQ.put("تسعميه وواحد وأربعين", 941);
        IQ.put("تسعميه وواحد واربعين", 941);
        IQ.put("تسعميه وواحد وتسعين", 991);
        IQ.put("تسعميه وواحد وثلاثين", 931);
        IQ.put("تسعميه وواحد وثمانين", 981);
        IQ.put("تسعميه وواحد وثمنين", 981);
        IQ.put("تسعميه وواحد وخمسين", 951);
        IQ.put("تسعميه وواحد وسبعين", 971);
        IQ.put("تسعميه وواحد وستين", 961);
        IQ.put("تسعميه وواحد وعشرين", 921);
        IQ.put("تسعميه وواحد وكلاثين", 931);
        IQ.put("تسعميه وواحده", 901);
        IQ.put("تسعميه وواحده وأربعين", 941);
        IQ.put("تسعميه وواحده واربعين", 941);
        IQ.put("تسعميه وواحده وتسعين", 991);
        IQ.put("تسعميه وواحده وثلاثين", 931);
        IQ.put("تسعميه وواحده وثمانين", 981);
        IQ.put("تسعميه وواحده وثمنين", 981);
        IQ.put("تسعميه وواحده وخمسين", 951);
        IQ.put("تسعميه وواحده وسبعين", 971);
        IQ.put("تسعميه وواحده وستين", 961);
        IQ.put("تسعميه وواحده وعشرين", 921);
        IQ.put("تسعميه وواحده وكلاثين", 931);
        IQ.put("تسعميه ووحده", 901);
        IQ.put("تسعميه ووحده وأربعين", 941);
        IQ.put("تسعميه ووحده واربعين", 941);
        IQ.put("تسعميه ووحده وتسعين", 991);
        IQ.put("تسعميه ووحده وثلاثين", 931);
        IQ.put("تسعميه ووحده وثمانين", 981);
        IQ.put("تسعميه ووحده وثمنين", 981);
        IQ.put("تسعميه ووحده وخمسين", 951);
        IQ.put("تسعميه ووحده وسبعين", 971);
        IQ.put("تسعميه ووحده وستين", 961);
        IQ.put("تسعميه ووحده وعشرين", 921);
        IQ.put("تسعميه ووحده وكلاثين", 931);
    }
    static Integer iq(String s) { return IQ.get(s); }
    static Integer fu(String s) { return FU.get(s); }
}