package org.telegram.ui.Components;

import java.util.HashMap;
import java.util.Map;

final class YasuVoiceNumberDict_710 {
    private static final Map<String, Integer> IQ = new HashMap<>();
    private static final Map<String, Integer> FU = new HashMap<>();
    static {
        IQ.put("خمسميه وكلاثين وسته", 536);
        IQ.put("خمسميه وكلاثين وكلاث", 533);
        IQ.put("خمسميه وكلاثين وكلاثه", 533);
        IQ.put("خمسميه وكلاثين وواحد", 531);
        IQ.put("خمسميه وكلاثين وواحده", 531);
        IQ.put("خمسميه وكلاثين ووحده", 531);
        IQ.put("خمسميه وكلطعش", 513);
        IQ.put("خمسميه وواحد", 501);
        IQ.put("خمسميه وواحد وأربعين", 541);
        IQ.put("خمسميه وواحد واربعين", 541);
        IQ.put("خمسميه وواحد وتسعين", 591);
        IQ.put("خمسميه وواحد وثلاثين", 531);
        IQ.put("خمسميه وواحد وثمانين", 581);
        IQ.put("خمسميه وواحد وثمنين", 581);
        IQ.put("خمسميه وواحد وخمسين", 551);
        IQ.put("خمسميه وواحد وسبعين", 571);
        IQ.put("خمسميه وواحد وستين", 561);
        IQ.put("خمسميه وواحد وعشرين", 521);
        IQ.put("خمسميه وواحد وكلاثين", 531);
        IQ.put("خمسميه وواحده", 501);
        IQ.put("خمسميه وواحده وأربعين", 541);
        IQ.put("خمسميه وواحده واربعين", 541);
        IQ.put("خمسميه وواحده وتسعين", 591);
        IQ.put("خمسميه وواحده وثلاثين", 531);
        IQ.put("خمسميه وواحده وثمانين", 581);
        IQ.put("خمسميه وواحده وثمنين", 581);
        IQ.put("خمسميه وواحده وخمسين", 551);
        IQ.put("خمسميه وواحده وسبعين", 571);
        IQ.put("خمسميه وواحده وستين", 561);
        IQ.put("خمسميه وواحده وعشرين", 521);
        IQ.put("خمسميه وواحده وكلاثين", 531);
        IQ.put("خمسميه ووحده", 501);
        IQ.put("خمسميه ووحده وأربعين", 541);
        IQ.put("خمسميه ووحده واربعين", 541);
        IQ.put("خمسميه ووحده وتسعين", 591);
        IQ.put("خمسميه ووحده وثلاثين", 531);
        IQ.put("خمسميه ووحده وثمانين", 581);
        IQ.put("خمسميه ووحده وثمنين", 581);
        IQ.put("خمسميه ووحده وخمسين", 551);
        IQ.put("خمسميه ووحده وسبعين", 571);
        IQ.put("خمسميه ووحده وستين", 561);
        IQ.put("خمسميه ووحده وعشرين", 521);
        IQ.put("خمسميه ووحده وكلاثين", 531);
    }
    static Integer iq(String s) { return IQ.get(s); }
    static Integer fu(String s) { return FU.get(s); }
}