package org.telegram.ui.Components;

import java.util.HashMap;
import java.util.Map;

final class YasuVoiceNumberDict_760 {
    private static final Map<String, Integer> IQ = new HashMap<>();
    private static final Map<String, Integer> FU = new HashMap<>();
    static {
        FU.put("سبعماية وعشرين وخمسه", 725);
        FU.put("سبعماية وعشرين وسبعة", 727);
        FU.put("سبعماية وعشرين وسبعه", 727);
        FU.put("سبعماية وعشرين وستة", 726);
        FU.put("سبعماية وعشرين وسته", 726);
        FU.put("سبعماية وعشرين وواحد", 721);
        FU.put("سبعماية وعشرين وواحدا", 721);
        FU.put("سبعماية وواحد", 701);
        FU.put("سبعماية وواحد وأربعون", 741);
        FU.put("سبعماية وواحد وأربعين", 741);
        FU.put("سبعماية وواحد واربعون", 741);
        FU.put("سبعماية وواحد واربعين", 741);
        FU.put("سبعماية وواحد وتسعون", 791);
        FU.put("سبعماية وواحد وتسعين", 791);
        FU.put("سبعماية وواحد وثلاثون", 731);
        FU.put("سبعماية وواحد وثلاثين", 731);
        FU.put("سبعماية وواحد وثمانون", 781);
        FU.put("سبعماية وواحد وثمانين", 781);
        FU.put("سبعماية وواحد وخمسون", 751);
        FU.put("سبعماية وواحد وخمسين", 751);
        FU.put("سبعماية وواحد وسبعون", 771);
        FU.put("سبعماية وواحد وسبعين", 771);
        FU.put("سبعماية وواحد وستون", 761);
        FU.put("سبعماية وواحد وستين", 761);
        FU.put("سبعماية وواحد وعشرون", 721);
        FU.put("سبعماية وواحد وعشرين", 721);
        FU.put("سبعماية وواحدا", 701);
        FU.put("سبعماية وواحدا وأربعون", 741);
        FU.put("سبعماية وواحدا وأربعين", 741);
        FU.put("سبعماية وواحدا واربعون", 741);
        FU.put("سبعماية وواحدا واربعين", 741);
        FU.put("سبعماية وواحدا وتسعون", 791);
        FU.put("سبعماية وواحدا وتسعين", 791);
        FU.put("سبعماية وواحدا وثلاثون", 731);
        FU.put("سبعماية وواحدا وثلاثين", 731);
        FU.put("سبعماية وواحدا وثمانون", 781);
        FU.put("سبعماية وواحدا وثمانين", 781);
        FU.put("سبعماية وواحدا وخمسون", 751);
        FU.put("سبعماية وواحدا وخمسين", 751);
        FU.put("سبعماية وواحدا وسبعون", 771);
        FU.put("سبعماية وواحدا وسبعين", 771);
        FU.put("سبعماية وواحدا وستون", 761);
        FU.put("سبعماية وواحدا وستين", 761);
        FU.put("سبعماية وواحدا وعشرون", 721);
        FU.put("سبعماية وواحدا وعشرين", 721);
    }
    static Integer iq(String s) { return IQ.get(s); }
    static Integer fu(String s) { return FU.get(s); }
}