package org.telegram.ui.Components;

import java.util.HashMap;
import java.util.Map;

final class YasuVoiceNumberDict_827 {
    private static final Map<String, Integer> IQ = new HashMap<>();
    private static final Map<String, Integer> FU = new HashMap<>();
    static {
        IQ.put("سبعميه وكلاثين وسته", 736);
        IQ.put("سبعميه وكلاثين وكلاث", 733);
        IQ.put("سبعميه وكلاثين وكلاثه", 733);
        IQ.put("سبعميه وكلاثين وواحد", 731);
        IQ.put("سبعميه وكلاثين وواحده", 731);
        IQ.put("سبعميه وكلاثين ووحده", 731);
        IQ.put("سبعميه وكلطعش", 713);
        IQ.put("سبعميه وواحد", 701);
        IQ.put("سبعميه وواحد وأربعين", 741);
        IQ.put("سبعميه وواحد واربعين", 741);
        IQ.put("سبعميه وواحد وتسعين", 791);
        IQ.put("سبعميه وواحد وثلاثين", 731);
        IQ.put("سبعميه وواحد وثمانين", 781);
        IQ.put("سبعميه وواحد وثمنين", 781);
        IQ.put("سبعميه وواحد وخمسين", 751);
        IQ.put("سبعميه وواحد وسبعين", 771);
        IQ.put("سبعميه وواحد وستين", 761);
        IQ.put("سبعميه وواحد وعشرين", 721);
        IQ.put("سبعميه وواحد وكلاثين", 731);
        IQ.put("سبعميه وواحده", 701);
        IQ.put("سبعميه وواحده وأربعين", 741);
        IQ.put("سبعميه وواحده واربعين", 741);
        IQ.put("سبعميه وواحده وتسعين", 791);
        IQ.put("سبعميه وواحده وثلاثين", 731);
        IQ.put("سبعميه وواحده وثمانين", 781);
        IQ.put("سبعميه وواحده وثمنين", 781);
        IQ.put("سبعميه وواحده وخمسين", 751);
        IQ.put("سبعميه وواحده وسبعين", 771);
        IQ.put("سبعميه وواحده وستين", 761);
        IQ.put("سبعميه وواحده وعشرين", 721);
        IQ.put("سبعميه وواحده وكلاثين", 731);
        IQ.put("سبعميه ووحده", 701);
        IQ.put("سبعميه ووحده وأربعين", 741);
        IQ.put("سبعميه ووحده واربعين", 741);
        IQ.put("سبعميه ووحده وتسعين", 791);
        IQ.put("سبعميه ووحده وثلاثين", 731);
        IQ.put("سبعميه ووحده وثمانين", 781);
        IQ.put("سبعميه ووحده وثمنين", 781);
        IQ.put("سبعميه ووحده وخمسين", 751);
        IQ.put("سبعميه ووحده وسبعين", 771);
        IQ.put("سبعميه ووحده وستين", 761);
        IQ.put("سبعميه ووحده وعشرين", 721);
        IQ.put("سبعميه ووحده وكلاثين", 731);
    }
    static Integer iq(String s) { return IQ.get(s); }
    static Integer fu(String s) { return FU.get(s); }
}