package org.telegram.ui.Components;

import java.util.HashMap;
import java.util.Map;

final class YasuVoiceNumberDict_492 {
    private static final Map<String, Integer> IQ = new HashMap<>();
    private static final Map<String, Integer> FU = new HashMap<>();
    static {
        FU.put("ثمانماية وعشرين وخمسه", 825);
        FU.put("ثمانماية وعشرين وسبعة", 827);
        FU.put("ثمانماية وعشرين وسبعه", 827);
        FU.put("ثمانماية وعشرين وستة", 826);
        FU.put("ثمانماية وعشرين وسته", 826);
        FU.put("ثمانماية وعشرين وواحد", 821);
        FU.put("ثمانماية وعشرين وواحدا", 821);
        FU.put("ثمانماية وواحد", 801);
        FU.put("ثمانماية وواحد وأربعون", 841);
        FU.put("ثمانماية وواحد وأربعين", 841);
        FU.put("ثمانماية وواحد واربعون", 841);
        FU.put("ثمانماية وواحد واربعين", 841);
        FU.put("ثمانماية وواحد وتسعون", 891);
        FU.put("ثمانماية وواحد وتسعين", 891);
        FU.put("ثمانماية وواحد وثلاثون", 831);
        FU.put("ثمانماية وواحد وثلاثين", 831);
        FU.put("ثمانماية وواحد وثمانون", 881);
        FU.put("ثمانماية وواحد وثمانين", 881);
        FU.put("ثمانماية وواحد وخمسون", 851);
        FU.put("ثمانماية وواحد وخمسين", 851);
        FU.put("ثمانماية وواحد وسبعون", 871);
        FU.put("ثمانماية وواحد وسبعين", 871);
        FU.put("ثمانماية وواحد وستون", 861);
        FU.put("ثمانماية وواحد وستين", 861);
        FU.put("ثمانماية وواحد وعشرون", 821);
        FU.put("ثمانماية وواحد وعشرين", 821);
        FU.put("ثمانماية وواحدا", 801);
        FU.put("ثمانماية وواحدا وأربعون", 841);
        FU.put("ثمانماية وواحدا وأربعين", 841);
        FU.put("ثمانماية وواحدا واربعون", 841);
        FU.put("ثمانماية وواحدا واربعين", 841);
        FU.put("ثمانماية وواحدا وتسعون", 891);
        FU.put("ثمانماية وواحدا وتسعين", 891);
        FU.put("ثمانماية وواحدا وثلاثون", 831);
        FU.put("ثمانماية وواحدا وثلاثين", 831);
        FU.put("ثمانماية وواحدا وثمانون", 881);
        FU.put("ثمانماية وواحدا وثمانين", 881);
        FU.put("ثمانماية وواحدا وخمسون", 851);
        FU.put("ثمانماية وواحدا وخمسين", 851);
        FU.put("ثمانماية وواحدا وسبعون", 871);
        FU.put("ثمانماية وواحدا وسبعين", 871);
        FU.put("ثمانماية وواحدا وستون", 861);
        FU.put("ثمانماية وواحدا وستين", 861);
        FU.put("ثمانماية وواحدا وعشرون", 821);
        FU.put("ثمانماية وواحدا وعشرين", 821);
    }
    static Integer iq(String s) { return IQ.get(s); }
    static Integer fu(String s) { return FU.get(s); }
}