package org.telegram.ui.Components;

import java.util.HashMap;
import java.util.Map;

final class YasuVoiceNumberDict_443 {
    private static final Map<String, Integer> IQ = new HashMap<>();
    private static final Map<String, Integer> FU = new HashMap<>();
    static {
        IQ.put("ثلاثميه وكلاثين وسته", 336);
        IQ.put("ثلاثميه وكلاثين وكلاث", 333);
        IQ.put("ثلاثميه وكلاثين وكلاثه", 333);
        IQ.put("ثلاثميه وكلاثين وواحد", 331);
        IQ.put("ثلاثميه وكلاثين وواحده", 331);
        IQ.put("ثلاثميه وكلاثين ووحده", 331);
        IQ.put("ثلاثميه وكلطعش", 313);
        IQ.put("ثلاثميه وواحد", 301);
        IQ.put("ثلاثميه وواحد وأربعين", 341);
        IQ.put("ثلاثميه وواحد واربعين", 341);
        IQ.put("ثلاثميه وواحد وتسعين", 391);
        IQ.put("ثلاثميه وواحد وثلاثين", 331);
        IQ.put("ثلاثميه وواحد وثمانين", 381);
        IQ.put("ثلاثميه وواحد وثمنين", 381);
        IQ.put("ثلاثميه وواحد وخمسين", 351);
        IQ.put("ثلاثميه وواحد وسبعين", 371);
        IQ.put("ثلاثميه وواحد وستين", 361);
        IQ.put("ثلاثميه وواحد وعشرين", 321);
        IQ.put("ثلاثميه وواحد وكلاثين", 331);
        IQ.put("ثلاثميه وواحده", 301);
        IQ.put("ثلاثميه وواحده وأربعين", 341);
        IQ.put("ثلاثميه وواحده واربعين", 341);
        IQ.put("ثلاثميه وواحده وتسعين", 391);
        IQ.put("ثلاثميه وواحده وثلاثين", 331);
        IQ.put("ثلاثميه وواحده وثمانين", 381);
        IQ.put("ثلاثميه وواحده وثمنين", 381);
        IQ.put("ثلاثميه وواحده وخمسين", 351);
        IQ.put("ثلاثميه وواحده وسبعين", 371);
        IQ.put("ثلاثميه وواحده وستين", 361);
        IQ.put("ثلاثميه وواحده وعشرين", 321);
        IQ.put("ثلاثميه وواحده وكلاثين", 331);
        IQ.put("ثلاثميه ووحده", 301);
        IQ.put("ثلاثميه ووحده وأربعين", 341);
        IQ.put("ثلاثميه ووحده واربعين", 341);
        IQ.put("ثلاثميه ووحده وتسعين", 391);
        IQ.put("ثلاثميه ووحده وثلاثين", 331);
        IQ.put("ثلاثميه ووحده وثمانين", 381);
        IQ.put("ثلاثميه ووحده وثمنين", 381);
        IQ.put("ثلاثميه ووحده وخمسين", 351);
        IQ.put("ثلاثميه ووحده وسبعين", 371);
        IQ.put("ثلاثميه ووحده وستين", 361);
        IQ.put("ثلاثميه ووحده وعشرين", 321);
        IQ.put("ثلاثميه ووحده وكلاثين", 331);
    }
    static Integer iq(String s) { return IQ.get(s); }
    static Integer fu(String s) { return FU.get(s); }
}