package org.telegram.ui.Components;

import java.util.HashMap;
import java.util.Map;

final class YasuVoiceNumberDict_944 {
    private static final Map<String, Integer> IQ = new HashMap<>();
    private static final Map<String, Integer> FU = new HashMap<>();
    static {
        IQ.put("ستميه وكلاثين وسته", 636);
        IQ.put("ستميه وكلاثين وكلاث", 633);
        IQ.put("ستميه وكلاثين وكلاثه", 633);
        IQ.put("ستميه وكلاثين وواحد", 631);
        IQ.put("ستميه وكلاثين وواحده", 631);
        IQ.put("ستميه وكلاثين ووحده", 631);
        IQ.put("ستميه وكلطعش", 613);
        IQ.put("ستميه وواحد", 601);
        IQ.put("ستميه وواحد وأربعين", 641);
        IQ.put("ستميه وواحد واربعين", 641);
        IQ.put("ستميه وواحد وتسعين", 691);
        IQ.put("ستميه وواحد وثلاثين", 631);
        IQ.put("ستميه وواحد وثمانين", 681);
        IQ.put("ستميه وواحد وثمنين", 681);
        IQ.put("ستميه وواحد وخمسين", 651);
        IQ.put("ستميه وواحد وسبعين", 671);
        IQ.put("ستميه وواحد وستين", 661);
        IQ.put("ستميه وواحد وعشرين", 621);
        IQ.put("ستميه وواحد وكلاثين", 631);
        IQ.put("ستميه وواحده", 601);
        IQ.put("ستميه وواحده وأربعين", 641);
        IQ.put("ستميه وواحده واربعين", 641);
        IQ.put("ستميه وواحده وتسعين", 691);
        IQ.put("ستميه وواحده وثلاثين", 631);
        IQ.put("ستميه وواحده وثمانين", 681);
        IQ.put("ستميه وواحده وثمنين", 681);
        IQ.put("ستميه وواحده وخمسين", 651);
        IQ.put("ستميه وواحده وسبعين", 671);
        IQ.put("ستميه وواحده وستين", 661);
        IQ.put("ستميه وواحده وعشرين", 621);
        IQ.put("ستميه وواحده وكلاثين", 631);
        IQ.put("ستميه ووحده", 601);
        IQ.put("ستميه ووحده وأربعين", 641);
        IQ.put("ستميه ووحده واربعين", 641);
        IQ.put("ستميه ووحده وتسعين", 691);
        IQ.put("ستميه ووحده وثلاثين", 631);
        IQ.put("ستميه ووحده وثمانين", 681);
        IQ.put("ستميه ووحده وثمنين", 681);
        IQ.put("ستميه ووحده وخمسين", 651);
        IQ.put("ستميه ووحده وسبعين", 671);
        IQ.put("ستميه ووحده وستين", 661);
        IQ.put("ستميه ووحده وعشرين", 621);
        IQ.put("ستميه ووحده وكلاثين", 631);
    }
    static Integer iq(String s) { return IQ.get(s); }
    static Integer fu(String s) { return FU.get(s); }
}