package org.telegram.ui.Components;

import java.util.HashMap;
import java.util.Map;

final class YasuVoiceNumberDict_1108 {
    private static final Map<String, Integer> IQ = new HashMap<>();
    private static final Map<String, Integer> FU = new HashMap<>();
    static {
        FU.put("ميتان وعشرين وخمسه", 225);
        FU.put("ميتان وعشرين وسبعة", 227);
        FU.put("ميتان وعشرين وسبعه", 227);
        FU.put("ميتان وعشرين وستة", 226);
        FU.put("ميتان وعشرين وسته", 226);
        FU.put("ميتان وعشرين وواحد", 221);
        FU.put("ميتان وعشرين وواحدا", 221);
        FU.put("ميتان وواحد", 201);
        FU.put("ميتان وواحد وأربعون", 241);
        FU.put("ميتان وواحد وأربعين", 241);
        FU.put("ميتان وواحد واربعون", 241);
        FU.put("ميتان وواحد واربعين", 241);
        FU.put("ميتان وواحد وتسعون", 291);
        FU.put("ميتان وواحد وتسعين", 291);
        FU.put("ميتان وواحد وثلاثون", 231);
        FU.put("ميتان وواحد وثلاثين", 231);
        FU.put("ميتان وواحد وثمانون", 281);
        FU.put("ميتان وواحد وثمانين", 281);
        FU.put("ميتان وواحد وخمسون", 251);
        FU.put("ميتان وواحد وخمسين", 251);
        FU.put("ميتان وواحد وسبعون", 271);
        FU.put("ميتان وواحد وسبعين", 271);
        FU.put("ميتان وواحد وستون", 261);
        FU.put("ميتان وواحد وستين", 261);
        FU.put("ميتان وواحد وعشرون", 221);
        FU.put("ميتان وواحد وعشرين", 221);
        FU.put("ميتان وواحدا", 201);
        FU.put("ميتان وواحدا وأربعون", 241);
        FU.put("ميتان وواحدا وأربعين", 241);
        FU.put("ميتان وواحدا واربعون", 241);
        FU.put("ميتان وواحدا واربعين", 241);
        FU.put("ميتان وواحدا وتسعون", 291);
        FU.put("ميتان وواحدا وتسعين", 291);
        FU.put("ميتان وواحدا وثلاثون", 231);
        FU.put("ميتان وواحدا وثلاثين", 231);
        FU.put("ميتان وواحدا وثمانون", 281);
        FU.put("ميتان وواحدا وثمانين", 281);
        FU.put("ميتان وواحدا وخمسون", 251);
        FU.put("ميتان وواحدا وخمسين", 251);
        FU.put("ميتان وواحدا وسبعون", 271);
        FU.put("ميتان وواحدا وسبعين", 271);
        FU.put("ميتان وواحدا وستون", 261);
        FU.put("ميتان وواحدا وستين", 261);
        FU.put("ميتان وواحدا وعشرون", 221);
        FU.put("ميتان وواحدا وعشرين", 221);
    }
    static Integer iq(String s) { return IQ.get(s); }
    static Integer fu(String s) { return FU.get(s); }
}