package org.telegram.ui.Components;

import java.util.HashMap;
import java.util.Map;

final class YasuVoiceNumberDict_259 {
    private static final Map<String, Integer> IQ = new HashMap<>();
    private static final Map<String, Integer> FU = new HashMap<>();
    static {
        FU.put("تسعماية وعشرين وخمسه", 925);
        FU.put("تسعماية وعشرين وسبعة", 927);
        FU.put("تسعماية وعشرين وسبعه", 927);
        FU.put("تسعماية وعشرين وستة", 926);
        FU.put("تسعماية وعشرين وسته", 926);
        FU.put("تسعماية وعشرين وواحد", 921);
        FU.put("تسعماية وعشرين وواحدا", 921);
        FU.put("تسعماية وواحد", 901);
        FU.put("تسعماية وواحد وأربعون", 941);
        FU.put("تسعماية وواحد وأربعين", 941);
        FU.put("تسعماية وواحد واربعون", 941);
        FU.put("تسعماية وواحد واربعين", 941);
        FU.put("تسعماية وواحد وتسعون", 991);
        FU.put("تسعماية وواحد وتسعين", 991);
        FU.put("تسعماية وواحد وثلاثون", 931);
        FU.put("تسعماية وواحد وثلاثين", 931);
        FU.put("تسعماية وواحد وثمانون", 981);
        FU.put("تسعماية وواحد وثمانين", 981);
        FU.put("تسعماية وواحد وخمسون", 951);
        FU.put("تسعماية وواحد وخمسين", 951);
        FU.put("تسعماية وواحد وسبعون", 971);
        FU.put("تسعماية وواحد وسبعين", 971);
        FU.put("تسعماية وواحد وستون", 961);
        FU.put("تسعماية وواحد وستين", 961);
        FU.put("تسعماية وواحد وعشرون", 921);
        FU.put("تسعماية وواحد وعشرين", 921);
        FU.put("تسعماية وواحدا", 901);
        FU.put("تسعماية وواحدا وأربعون", 941);
        FU.put("تسعماية وواحدا وأربعين", 941);
        FU.put("تسعماية وواحدا واربعون", 941);
        FU.put("تسعماية وواحدا واربعين", 941);
        FU.put("تسعماية وواحدا وتسعون", 991);
        FU.put("تسعماية وواحدا وتسعين", 991);
        FU.put("تسعماية وواحدا وثلاثون", 931);
        FU.put("تسعماية وواحدا وثلاثين", 931);
        FU.put("تسعماية وواحدا وثمانون", 981);
        FU.put("تسعماية وواحدا وثمانين", 981);
        FU.put("تسعماية وواحدا وخمسون", 951);
        FU.put("تسعماية وواحدا وخمسين", 951);
        FU.put("تسعماية وواحدا وسبعون", 971);
        FU.put("تسعماية وواحدا وسبعين", 971);
        FU.put("تسعماية وواحدا وستون", 961);
        FU.put("تسعماية وواحدا وستين", 961);
        FU.put("تسعماية وواحدا وعشرون", 921);
        FU.put("تسعماية وواحدا وعشرين", 921);
    }
    static Integer iq(String s) { return IQ.get(s); }
    static Integer fu(String s) { return FU.get(s); }
}