package org.telegram.ui.Components;

import java.util.HashMap;
import java.util.Map;

final class YasuVoiceNumberDict_877 {
    private static final Map<String, Integer> IQ = new HashMap<>();
    private static final Map<String, Integer> FU = new HashMap<>();
    static {
        FU.put("ستماية وعشرين وخمسه", 625);
        FU.put("ستماية وعشرين وسبعة", 627);
        FU.put("ستماية وعشرين وسبعه", 627);
        FU.put("ستماية وعشرين وستة", 626);
        FU.put("ستماية وعشرين وسته", 626);
        FU.put("ستماية وعشرين وواحد", 621);
        FU.put("ستماية وعشرين وواحدا", 621);
        FU.put("ستماية وواحد", 601);
        FU.put("ستماية وواحد وأربعون", 641);
        FU.put("ستماية وواحد وأربعين", 641);
        FU.put("ستماية وواحد واربعون", 641);
        FU.put("ستماية وواحد واربعين", 641);
        FU.put("ستماية وواحد وتسعون", 691);
        FU.put("ستماية وواحد وتسعين", 691);
        FU.put("ستماية وواحد وثلاثون", 631);
        FU.put("ستماية وواحد وثلاثين", 631);
        FU.put("ستماية وواحد وثمانون", 681);
        FU.put("ستماية وواحد وثمانين", 681);
        FU.put("ستماية وواحد وخمسون", 651);
        FU.put("ستماية وواحد وخمسين", 651);
        FU.put("ستماية وواحد وسبعون", 671);
        FU.put("ستماية وواحد وسبعين", 671);
        FU.put("ستماية وواحد وستون", 661);
        FU.put("ستماية وواحد وستين", 661);
        FU.put("ستماية وواحد وعشرون", 621);
        FU.put("ستماية وواحد وعشرين", 621);
        FU.put("ستماية وواحدا", 601);
        FU.put("ستماية وواحدا وأربعون", 641);
        FU.put("ستماية وواحدا وأربعين", 641);
        FU.put("ستماية وواحدا واربعون", 641);
        FU.put("ستماية وواحدا واربعين", 641);
        FU.put("ستماية وواحدا وتسعون", 691);
        FU.put("ستماية وواحدا وتسعين", 691);
        FU.put("ستماية وواحدا وثلاثون", 631);
        FU.put("ستماية وواحدا وثلاثين", 631);
        FU.put("ستماية وواحدا وثمانون", 681);
        FU.put("ستماية وواحدا وثمانين", 681);
        FU.put("ستماية وواحدا وخمسون", 651);
        FU.put("ستماية وواحدا وخمسين", 651);
        FU.put("ستماية وواحدا وسبعون", 671);
        FU.put("ستماية وواحدا وسبعين", 671);
        FU.put("ستماية وواحدا وستون", 661);
        FU.put("ستماية وواحدا وستين", 661);
        FU.put("ستماية وواحدا وعشرون", 621);
        FU.put("ستماية وواحدا وعشرين", 621);
    }
    static Integer iq(String s) { return IQ.get(s); }
    static Integer fu(String s) { return FU.get(s); }
}