package org.telegram.ui.Components;

import java.util.HashMap;
import java.util.Map;

final class YasuVoiceNumberDict_979 {
    private static final Map<String, Integer> IQ = new HashMap<>();
    private static final Map<String, Integer> FU = new HashMap<>();
    static {
        IQ.put("كلاثميه وكلاثين وسته", 336);
        IQ.put("كلاثميه وكلاثين وكلاث", 333);
        IQ.put("كلاثميه وكلاثين وكلاثه", 333);
        IQ.put("كلاثميه وكلاثين وواحد", 331);
        IQ.put("كلاثميه وكلاثين وواحده", 331);
        IQ.put("كلاثميه وكلاثين ووحده", 331);
        IQ.put("كلاثميه وكلطعش", 313);
        IQ.put("كلاثميه وواحد", 301);
        IQ.put("كلاثميه وواحد وأربعين", 341);
        IQ.put("كلاثميه وواحد واربعين", 341);
        IQ.put("كلاثميه وواحد وتسعين", 391);
        IQ.put("كلاثميه وواحد وثلاثين", 331);
        IQ.put("كلاثميه وواحد وثمانين", 381);
        IQ.put("كلاثميه وواحد وثمنين", 381);
        IQ.put("كلاثميه وواحد وخمسين", 351);
        IQ.put("كلاثميه وواحد وسبعين", 371);
        IQ.put("كلاثميه وواحد وستين", 361);
        IQ.put("كلاثميه وواحد وعشرين", 321);
        IQ.put("كلاثميه وواحد وكلاثين", 331);
        IQ.put("كلاثميه وواحده", 301);
        IQ.put("كلاثميه وواحده وأربعين", 341);
        IQ.put("كلاثميه وواحده واربعين", 341);
        IQ.put("كلاثميه وواحده وتسعين", 391);
        IQ.put("كلاثميه وواحده وثلاثين", 331);
        IQ.put("كلاثميه وواحده وثمانين", 381);
        IQ.put("كلاثميه وواحده وثمنين", 381);
        IQ.put("كلاثميه وواحده وخمسين", 351);
        IQ.put("كلاثميه وواحده وسبعين", 371);
        IQ.put("كلاثميه وواحده وستين", 361);
        IQ.put("كلاثميه وواحده وعشرين", 321);
        IQ.put("كلاثميه وواحده وكلاثين", 331);
        IQ.put("كلاثميه ووحده", 301);
        IQ.put("كلاثميه ووحده وأربعين", 341);
        IQ.put("كلاثميه ووحده واربعين", 341);
        IQ.put("كلاثميه ووحده وتسعين", 391);
        IQ.put("كلاثميه ووحده وثلاثين", 331);
        IQ.put("كلاثميه ووحده وثمانين", 381);
        IQ.put("كلاثميه ووحده وثمنين", 381);
        IQ.put("كلاثميه ووحده وخمسين", 351);
        IQ.put("كلاثميه ووحده وسبعين", 371);
        IQ.put("كلاثميه ووحده وستين", 361);
        IQ.put("كلاثميه ووحده وعشرين", 321);
        IQ.put("كلاثميه ووحده وكلاثين", 331);
    }
    static Integer iq(String s) { return IQ.get(s); }
    static Integer fu(String s) { return FU.get(s); }
}