package org.telegram.ui.Components;

import java.util.HashMap;
import java.util.Map;

final class YasuVoiceNumberDict_1012 {
    private static final Map<String, Integer> IQ = new HashMap<>();
    private static final Map<String, Integer> FU = new HashMap<>();
    static {
        FU.put("مايتان وعشرين وخمسه", 225);
        FU.put("مايتان وعشرين وسبعة", 227);
        FU.put("مايتان وعشرين وسبعه", 227);
        FU.put("مايتان وعشرين وستة", 226);
        FU.put("مايتان وعشرين وسته", 226);
        FU.put("مايتان وعشرين وواحد", 221);
        FU.put("مايتان وعشرين وواحدا", 221);
        FU.put("مايتان وواحد", 201);
        FU.put("مايتان وواحد وأربعون", 241);
        FU.put("مايتان وواحد وأربعين", 241);
        FU.put("مايتان وواحد واربعون", 241);
        FU.put("مايتان وواحد واربعين", 241);
        FU.put("مايتان وواحد وتسعون", 291);
        FU.put("مايتان وواحد وتسعين", 291);
        FU.put("مايتان وواحد وثلاثون", 231);
        FU.put("مايتان وواحد وثلاثين", 231);
        FU.put("مايتان وواحد وثمانون", 281);
        FU.put("مايتان وواحد وثمانين", 281);
        FU.put("مايتان وواحد وخمسون", 251);
        FU.put("مايتان وواحد وخمسين", 251);
        FU.put("مايتان وواحد وسبعون", 271);
        FU.put("مايتان وواحد وسبعين", 271);
        FU.put("مايتان وواحد وستون", 261);
        FU.put("مايتان وواحد وستين", 261);
        FU.put("مايتان وواحد وعشرون", 221);
        FU.put("مايتان وواحد وعشرين", 221);
        FU.put("مايتان وواحدا", 201);
        FU.put("مايتان وواحدا وأربعون", 241);
        FU.put("مايتان وواحدا وأربعين", 241);
        FU.put("مايتان وواحدا واربعون", 241);
        FU.put("مايتان وواحدا واربعين", 241);
        FU.put("مايتان وواحدا وتسعون", 291);
        FU.put("مايتان وواحدا وتسعين", 291);
        FU.put("مايتان وواحدا وثلاثون", 231);
        FU.put("مايتان وواحدا وثلاثين", 231);
        FU.put("مايتان وواحدا وثمانون", 281);
        FU.put("مايتان وواحدا وثمانين", 281);
        FU.put("مايتان وواحدا وخمسون", 251);
        FU.put("مايتان وواحدا وخمسين", 251);
        FU.put("مايتان وواحدا وسبعون", 271);
        FU.put("مايتان وواحدا وسبعين", 271);
        FU.put("مايتان وواحدا وستون", 261);
        FU.put("مايتان وواحدا وستين", 261);
        FU.put("مايتان وواحدا وعشرون", 221);
        FU.put("مايتان وواحدا وعشرين", 221);
    }
    static Integer iq(String s) { return IQ.get(s); }
    static Integer fu(String s) { return FU.get(s); }
}