package org.telegram.ui.Components;

import java.util.HashMap;
import java.util.Map;

final class YasuVoiceNumberDict_376 {
    private static final Map<String, Integer> IQ = new HashMap<>();
    private static final Map<String, Integer> FU = new HashMap<>();
    static {
        FU.put("ثلاثماية وعشرين وخمسه", 325);
        FU.put("ثلاثماية وعشرين وسبعة", 327);
        FU.put("ثلاثماية وعشرين وسبعه", 327);
        FU.put("ثلاثماية وعشرين وستة", 326);
        FU.put("ثلاثماية وعشرين وسته", 326);
        FU.put("ثلاثماية وعشرين وواحد", 321);
        FU.put("ثلاثماية وعشرين وواحدا", 321);
        FU.put("ثلاثماية وواحد", 301);
        FU.put("ثلاثماية وواحد وأربعون", 341);
        FU.put("ثلاثماية وواحد وأربعين", 341);
        FU.put("ثلاثماية وواحد واربعون", 341);
        FU.put("ثلاثماية وواحد واربعين", 341);
        FU.put("ثلاثماية وواحد وتسعون", 391);
        FU.put("ثلاثماية وواحد وتسعين", 391);
        FU.put("ثلاثماية وواحد وثلاثون", 331);
        FU.put("ثلاثماية وواحد وثلاثين", 331);
        FU.put("ثلاثماية وواحد وثمانون", 381);
        FU.put("ثلاثماية وواحد وثمانين", 381);
        FU.put("ثلاثماية وواحد وخمسون", 351);
        FU.put("ثلاثماية وواحد وخمسين", 351);
        FU.put("ثلاثماية وواحد وسبعون", 371);
        FU.put("ثلاثماية وواحد وسبعين", 371);
        FU.put("ثلاثماية وواحد وستون", 361);
        FU.put("ثلاثماية وواحد وستين", 361);
        FU.put("ثلاثماية وواحد وعشرون", 321);
        FU.put("ثلاثماية وواحد وعشرين", 321);
        FU.put("ثلاثماية وواحدا", 301);
        FU.put("ثلاثماية وواحدا وأربعون", 341);
        FU.put("ثلاثماية وواحدا وأربعين", 341);
        FU.put("ثلاثماية وواحدا واربعون", 341);
        FU.put("ثلاثماية وواحدا واربعين", 341);
        FU.put("ثلاثماية وواحدا وتسعون", 391);
        FU.put("ثلاثماية وواحدا وتسعين", 391);
        FU.put("ثلاثماية وواحدا وثلاثون", 331);
        FU.put("ثلاثماية وواحدا وثلاثين", 331);
        FU.put("ثلاثماية وواحدا وثمانون", 381);
        FU.put("ثلاثماية وواحدا وثمانين", 381);
        FU.put("ثلاثماية وواحدا وخمسون", 351);
        FU.put("ثلاثماية وواحدا وخمسين", 351);
        FU.put("ثلاثماية وواحدا وسبعون", 371);
        FU.put("ثلاثماية وواحدا وسبعين", 371);
        FU.put("ثلاثماية وواحدا وستون", 361);
        FU.put("ثلاثماية وواحدا وستين", 361);
        FU.put("ثلاثماية وواحدا وعشرون", 321);
        FU.put("ثلاثماية وواحدا وعشرين", 321);
    }
    static Integer iq(String s) { return IQ.get(s); }
    static Integer fu(String s) { return FU.get(s); }
}