package org.telegram.ui.Components;

import java.util.HashMap;
import java.util.Map;

final class YasuVoiceNumberDict_559 {
    private static final Map<String, Integer> IQ = new HashMap<>();
    private static final Map<String, Integer> FU = new HashMap<>();
    static {
        IQ.put("ثمانميه وكلاثين وسته", 836);
        IQ.put("ثمانميه وكلاثين وكلاث", 833);
        IQ.put("ثمانميه وكلاثين وكلاثه", 833);
        IQ.put("ثمانميه وكلاثين وواحد", 831);
        IQ.put("ثمانميه وكلاثين وواحده", 831);
        IQ.put("ثمانميه وكلاثين ووحده", 831);
        IQ.put("ثمانميه وكلطعش", 813);
        IQ.put("ثمانميه وواحد", 801);
        IQ.put("ثمانميه وواحد وأربعين", 841);
        IQ.put("ثمانميه وواحد واربعين", 841);
        IQ.put("ثمانميه وواحد وتسعين", 891);
        IQ.put("ثمانميه وواحد وثلاثين", 831);
        IQ.put("ثمانميه وواحد وثمانين", 881);
        IQ.put("ثمانميه وواحد وثمنين", 881);
        IQ.put("ثمانميه وواحد وخمسين", 851);
        IQ.put("ثمانميه وواحد وسبعين", 871);
        IQ.put("ثمانميه وواحد وستين", 861);
        IQ.put("ثمانميه وواحد وعشرين", 821);
        IQ.put("ثمانميه وواحد وكلاثين", 831);
        IQ.put("ثمانميه وواحده", 801);
        IQ.put("ثمانميه وواحده وأربعين", 841);
        IQ.put("ثمانميه وواحده واربعين", 841);
        IQ.put("ثمانميه وواحده وتسعين", 891);
        IQ.put("ثمانميه وواحده وثلاثين", 831);
        IQ.put("ثمانميه وواحده وثمانين", 881);
        IQ.put("ثمانميه وواحده وثمنين", 881);
        IQ.put("ثمانميه وواحده وخمسين", 851);
        IQ.put("ثمانميه وواحده وسبعين", 871);
        IQ.put("ثمانميه وواحده وستين", 861);
        IQ.put("ثمانميه وواحده وعشرين", 821);
        IQ.put("ثمانميه وواحده وكلاثين", 831);
        IQ.put("ثمانميه ووحده", 801);
        IQ.put("ثمانميه ووحده وأربعين", 841);
        IQ.put("ثمانميه ووحده واربعين", 841);
        IQ.put("ثمانميه ووحده وتسعين", 891);
        IQ.put("ثمانميه ووحده وثلاثين", 831);
        IQ.put("ثمانميه ووحده وثمانين", 881);
        IQ.put("ثمانميه ووحده وثمنين", 881);
        IQ.put("ثمانميه ووحده وخمسين", 851);
        IQ.put("ثمانميه ووحده وسبعين", 871);
        IQ.put("ثمانميه ووحده وستين", 861);
        IQ.put("ثمانميه ووحده وعشرين", 821);
        IQ.put("ثمانميه ووحده وكلاثين", 831);
    }
    static Integer iq(String s) { return IQ.get(s); }
    static Integer fu(String s) { return FU.get(s); }
}