package org.telegram.ui.Components;

import java.util.HashMap;
import java.util.Map;

final class YasuVoiceNumberDict_643 {
    private static final Map<String, Integer> IQ = new HashMap<>();
    private static final Map<String, Integer> FU = new HashMap<>();
    static {
        FU.put("خمسماية وعشرين وخمسه", 525);
        FU.put("خمسماية وعشرين وسبعة", 527);
        FU.put("خمسماية وعشرين وسبعه", 527);
        FU.put("خمسماية وعشرين وستة", 526);
        FU.put("خمسماية وعشرين وسته", 526);
        FU.put("خمسماية وعشرين وواحد", 521);
        FU.put("خمسماية وعشرين وواحدا", 521);
        FU.put("خمسماية وواحد", 501);
        FU.put("خمسماية وواحد وأربعون", 541);
        FU.put("خمسماية وواحد وأربعين", 541);
        FU.put("خمسماية وواحد واربعون", 541);
        FU.put("خمسماية وواحد واربعين", 541);
        FU.put("خمسماية وواحد وتسعون", 591);
        FU.put("خمسماية وواحد وتسعين", 591);
        FU.put("خمسماية وواحد وثلاثون", 531);
        FU.put("خمسماية وواحد وثلاثين", 531);
        FU.put("خمسماية وواحد وثمانون", 581);
        FU.put("خمسماية وواحد وثمانين", 581);
        FU.put("خمسماية وواحد وخمسون", 551);
        FU.put("خمسماية وواحد وخمسين", 551);
        FU.put("خمسماية وواحد وسبعون", 571);
        FU.put("خمسماية وواحد وسبعين", 571);
        FU.put("خمسماية وواحد وستون", 561);
        FU.put("خمسماية وواحد وستين", 561);
        FU.put("خمسماية وواحد وعشرون", 521);
        FU.put("خمسماية وواحد وعشرين", 521);
        FU.put("خمسماية وواحدا", 501);
        FU.put("خمسماية وواحدا وأربعون", 541);
        FU.put("خمسماية وواحدا وأربعين", 541);
        FU.put("خمسماية وواحدا واربعون", 541);
        FU.put("خمسماية وواحدا واربعين", 541);
        FU.put("خمسماية وواحدا وتسعون", 591);
        FU.put("خمسماية وواحدا وتسعين", 591);
        FU.put("خمسماية وواحدا وثلاثون", 531);
        FU.put("خمسماية وواحدا وثلاثين", 531);
        FU.put("خمسماية وواحدا وثمانون", 581);
        FU.put("خمسماية وواحدا وثمانين", 581);
        FU.put("خمسماية وواحدا وخمسون", 551);
        FU.put("خمسماية وواحدا وخمسين", 551);
        FU.put("خمسماية وواحدا وسبعون", 571);
        FU.put("خمسماية وواحدا وسبعين", 571);
        FU.put("خمسماية وواحدا وستون", 561);
        FU.put("خمسماية وواحدا وستين", 561);
        FU.put("خمسماية وواحدا وعشرون", 521);
        FU.put("خمسماية وواحدا وعشرين", 521);
    }
    static Integer iq(String s) { return IQ.get(s); }
    static Integer fu(String s) { return FU.get(s); }
}